In [1]:
# Importing the required libraries

import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('database.sqlite')
c = conn.cursor()

In [3]:
c.execute("SELECT name FROM sqlite_master WHERE type='table'")
print(c.fetchall())

[('Salaries',)]

In [4]:
c.execute("PRAGMA table_info('Salaries')")
cols = c.fetchall()
for col in cols:
    print(col[1])

Id
EmployeeName
JobTitle
BasePay
OvertimePay
OtherPay
Benefits
TotalPay
TotalPayBenefits
Year
Notes
Agency
Status

In [5]:
# Reading the data from database and storing it in the dataframe
df = pd.read_sql_query("""SELECT * FROM Salaries""",conn)
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,,567595.43,567595.43,2011,,San Francisco,
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,,538909.28,538909.28,2011,,San Francisco,
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,,335279.91,335279.91,2011,,San Francisco,
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,,332343.61,332343.61,2011,,San Francisco,
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,,326373.19,326373.19,2011,,San Francisco,

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148654 non-null object
OvertimePay         148654 non-null object
OtherPay            148654 non-null object
Benefits            148654 non-null object
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               148654 non-null object
Agency              148654 non-null object
Status              148654 non-null object
dtypes: float64(2), int64(2), object(9)
memory usage: 14.7+ MB

## Q_sample: Who is getting the maximum salary?

In [7]:
max_salary = pd.read_sql_query("""SELECT EmployeeName,TotalPay
from Salaries  
WHERE TotalPay = (SELECT max(TotalPay) from Salaries)""",conn)

print(max_salary)

     EmployeeName   TotalPay
0  NATHANIEL FORD  567595.43

In [8]:
#pandas 

print(max(df.TotalPay))

567595.43

In [9]:
# Pandas Implementation

df.loc[df.TotalPay == max(df.TotalPay)]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,,567595.43,567595.43,2011,,San Francisco,

### 1. Retrieve the top 8 rows from the table

In [10]:
top_eight = pd.read_sql_query(""" SELECT * FROM Salaries
LIMIT 8""",conn)

top_eight

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,,567595.43,567595.43,2011,,San Francisco,
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,,538909.28,538909.28,2011,,San Francisco,
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,,335279.91,335279.91,2011,,San Francisco,
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,,332343.61,332343.61,2011,,San Francisco,
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,,326373.19,326373.19,2011,,San Francisco,
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.00,8601.00,189082.74,,316285.74,316285.74,2011,,San Francisco,
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.90,134426.14,,315981.05,315981.05,2011,,San Francisco,
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.00,51322.50,,307899.46,307899.46,2011,,San Francisco,

In [11]:
#pandas 

df.head(8)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,,567595.43,567595.43,2011,,San Francisco,
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,,538909.28,538909.28,2011,,San Francisco,
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,,335279.91,335279.91,2011,,San Francisco,
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,,332343.61,332343.61,2011,,San Francisco,
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,,326373.19,326373.19,2011,,San Francisco,
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602,8601,189083,,316285.74,316285.74,2011,,San Francisco,
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492,89062.9,134426,,315981.05,315981.05,2011,,San Francisco,
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256577,0,51322.5,,307899.46,307899.46,2011,,San Francisco,

### 2. What is the average TotalPay?

In [12]:
avg = pd.read_sql_query("""SELECT AVG(TotalPay)
FROM Salaries""",conn)
avg

   AVG(TotalPay)
0   74768.321972

In [13]:
#pandas

df.TotalPay.mean()

74768.321971703

### 3. What is the highest amount of BasePay in the dataset?

In [48]:
df['BasePay']=pd.read_sql_query("""
SELECT CAST(BasePay AS INT) FROM Salaries
""",conn)

Baspay_max = pd.read_sql_query("""SELECT max(BasePay)
from Salaries
WHERE BasePay!="Not Provided" and BasePay!=''

""",conn)

Baspay_max

   max(BasePay)
0     319275.01

In [41]:
#pandas
df.BasePay.max()

319275

### 4. What is the Job title of 'NATHANIEL FORD'?

In [17]:
job_title = pd.read_sql_query("""SELECT EmployeeName,JobTitle
FROM Salaries
WHERE EmployeeName =="NATHANIEL FORD"
""",conn)
job_title

     EmployeeName                                        JobTitle
0  NATHANIEL FORD  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY

In [18]:
df.loc[df.EmployeeName=="NATHANIEL FORD"]['JobTitle']

0    GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
Name: JobTitle, dtype: object

### 5. How much 'TotalPayBenefits' is made by 'NATHANIEL FORD'?

In [19]:
tot_pay_ben = pd.read_sql_query("""SELECT EmployeeName,TotalPayBenefits
FROM Salaries
WHERE EmployeeName =="NATHANIEL FORD"
""",conn)
tot_pay_ben

     EmployeeName  TotalPayBenefits
0  NATHANIEL FORD         567595.43

### 6. What was the average (mean) TotalPay of all employees per year? (Output for each year from 2011 to 2014 separately)

In [20]:
avg_by_year = pd.read_sql_query("""
SELECT AVG(TotalPay), Year
FROM Salaries
GROUP BY Year;

""",conn)

avg_by_year

   AVG(TotalPay)  Year
0   71744.103871  2011
1   74113.262265  2012
2   77611.443142  2013
3   75463.918140  2014

In [21]:
#pandas
df.groupby('Year')['TotalPay'].mean()

Year
2011    71744.103871
2012    74113.262265
2013    77611.443142
2014    75463.918140
Name: TotalPay, dtype: float64

### 7. How many unique jobs are there?

In [22]:
uni_job = pd.read_sql_query("""
SELECT COUNT(DISTINCT JobTitle) FROM Salaries;
""",conn)

uni_job

   COUNT(DISTINCT JobTitle)
0                      2159

In [23]:
#pandas
uni = df.groupby('JobTitle')['Id'].nunique()
uni.count()

2159

### 8. What are the top 5 most common jobs?

In [24]:
most_common_job = pd.read_sql_query("""
SELECT JobTitle
    FROM     Salaries
    GROUP BY JobTitle
    ORDER BY COUNT(*) DESC
    LIMIT    5;

""",conn)

most_common_job

                       JobTitle
0              Transit Operator
1                 Special Nurse
2              Registered Nurse
3  Public Svc Aide-Public Works
4              Police Officer 3

In [25]:
#pandas
df['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

### 9. How many people have the word Chief in their job title?

In [26]:
Chief_job = pd.read_sql_query("""
SELECT count(JobTitle) 
FROM Salaries
WHERE JobTitle LIKE '%Chief%'
""",conn)

Chief_job

   count(JobTitle)
0              627

In [28]:
count = 0

for line in df.JobTitle:
    if "Chief" in line:
        count+=1
    elif "CHIEF" in line:
        count+=1
print(count)

627